app/controllers/event_controller.rb

SELECT `event_images`.* FROM `event_images` WHERE `event_images`.`event_id` = 1
---
          return
        end

        if  !event_tobe_deleted.event_images.nil?  && event_tobe_deleted.event_images.count > 0