app/controllers/event_controller.rb

SELECT `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
---
  def deleteEvent

    msg = Hash.new

    if params[:event_id].nil? ||  params[:user_id].nil? ||  params[:passport_token].nil?

      arr_params = ["event_id", "user_id", "passport_token"]
      msg[:response] = CodeHelper.CODE_MISSING_PARAMS(arr_params)
      msg[:description] = "请提供所需参数"
      render :json =>  msg.to_json
      return
    end

    checkUser = checkUserExistBeforeOperationStart(params[:user_id], msg)

    if checkUser

      event_tobe_deleted = Event.find_by_id(params[:event_id])

UPDATE `event_images` SET `event_id` = NULL WHERE `event_images`.`event_id` = 1 AND `event_images`.`id` IN (1)
DELETE FROM `event_images` WHERE `event_images`.`id` = 1
DELETE FROM `events` WHERE `events`.`id` = 1
DELETE FROM `event_locations` WHERE `event_locations`.`id` = 1
---
          return
        end

        event_tobe_deleted.event_images.update_attributes(:image => nil)
        event_tobe_deleted.event_images.destroy_all()
        event_tobe_deleted.event_locations.destroy_all()