app/controllers/user_controller.rb

  def register

    msg = Hash.new

    if params[:account].nil? ||  params[:password].nil? ||  params[:device_uuid].nil?

      arr_params = ["account", "password", "device_uuid"]
      msg[:response] = CodeHelper.CODE_MISSING_PARAMS(arr_params)
      msg[:description] = "请填写所需信息..."
      render :json =>  msg.to_json
      return
    end

    user = User.where("account = ? and password = ?", params[:account], Digest::SHA1.hexdigest(params[:password]) ).first

    if user.nil?

      new_user = User.new
      new_user.account = params[:account]
      new_user.password =  Digest::SHA1.hexdigest(params[:password])
      new_user.email = params[:email]
      new_user.nickname = params[:nickname]
      new_user.uuid = params[:device_uuid]
      #new_user.uuid = new_user.generate_major

      if new_user.save
---
SELECT `users`.* FROM `users` WHERE (account = NULL and password = NULL) LIMIT 1
INSERT INTO `users` (`account`, `avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `email`, `major`, `minor`, `nickname`, `passport_token`, `password`, `sex`, `updated_at`, `uuid`) VALUES ('abc', NULL, NULL, NULL, NULL, '2014-06-28 04:21:10', NULL, NULL, NULL, NULL, NULL, 'abc', NULL, '2014-06-28 04:21:10', NULL)
INSERT INTO `uuids` (`created_at`, `updated_at`, `uuid`) VALUES ('2014-06-18 07:44:20', '2014-06-18 07:44:20', '22033cf4-70db-48c8-8cb6-64535ef04809')

  def userLogin

    msg = Hash.new

    if params[:account].nil? ||  params[:password].nil?  ||  params[:device_uuid].nil?

      arr_params = ["account", "password", "device_uuid"]
      msg[:response] = CodeHelper.CODE_MISSING_PARAMS(arr_params)
      msg[:description] = "请填写所需信息..."
      render :json =>  msg.to_json
      return
    end

    user = User.where("account = ? and password = ? and uuid = ?", params[:account], Digest::SHA1.hexdigest(params[:password]), params[:device_uuid] ).first

    if user.nil?

      msg[:response] = CodeHelper.CODE_USER_NOT_EXIST
      msg[:user] = ""
      msg[:description] = "该用户不存在"
      render :json =>  msg.to_json
    else
      msg[:response] = CodeHelper.CODE_SUCCESS
      user.passport_token = nil
      msg[:passport_token] =  user.generate_token
      user.update_attribute(:passport_token, msg[:passport_token] )
---
SELECT `users`.* FROM `users` WHERE (account = 'waynewgl' and password = '41b647369bc75c2bf8cdedb5b886bd086f605def' and uuid = '1231455') LIMIT 1
UPDATE `users` SET `passport_token` = '7cXoDwYUrq66wMFckXQSqw', `updated_at` = '2014-06-28 04:23:43' WHERE `users`.`id` = 20

  def upload_avatar_ios

    msg = Hash.new

    if params[:avatar].nil? || params[:user_id].blank? || params[:passport_token].blank?

      arr_params = ["avatar", "user_id", "passport token"]
      msg[:response] = CodeHelper.CODE_MISSING_PARAMS(arr_params)
      msg[:description] = "缺少必要参数"
      render :json =>  msg
      return
    else

      user = User.find_by_id(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 21 LIMIT 1

          return
        end

        if user.update_attributes(:avatar => params[:avatar])
---
UPDATE `users` SET `avatar_file_name` = 'avatar.jpeg', `avatar_content_type` = 'image/jpeg', `avatar_file_size` = 102162, `avatar_updated_at` = '2014-07-07 17:29:05', `updated_at` = '2014-07-07 17:29:05' WHERE `users`.`id` = 21

  def recordLocation

    msg = Hash.new

    if params[:longitude].nil? || params[:latitude].nil?  || params[:user_id].nil?   || params[:passport_token].nil?   || params[:start_time].nil?
      arr_params = ["longitude", "latitude", "user_id", "passport_token", "start_time"]
      msg[:response] = CodeHelper.CODE_MISSING_PARAMS(arr_params)
      msg[:description] = "需要提供longitude 和 latitude 位置信息 和 user id ,passport_token"
      render :json =>  msg.to_json
      return
    end

    checkUser = checkUserExistBeforeOperationStart(params[:user_id], msg)

    if checkUser

      userLocation = Location.new
      userLocation.latitude =  params[:latitude]
      userLocation.longitude =  params[:longitude]
      userLocation.content =  params[:content]
      start_date = Time.parse(params[:start_time])
      userLocation.start_date = start_date
      userLocation.user_id =  params[:user_id]

      if userLocation.save
---
INSERT INTO `locations` (`content`, `created_at`, `end_date`, `latitude`, `longitude`, `start_date`, `title`, `updated_at`, `user_id`) VALUES (NULL, '2014-07-03 10:24:00', NULL, 26.088336, 119.304043, '2014-07-03 10:16:27', NULL, '2014-07-03 10:24:00', '21')


        start_date = Time.parse(params[:start_date_from])
        end_date = Time.parse(params[:to_end_date])
        myLocations = User.find_by_id(params[:user_id]).locations.where("start_date >= ? and start_date <= ?",start_date,end_date).order("start_date")
      else

        myLocations = User.find_by_id(params[:user_id]).locations
---
SELECT `locations`.* FROM `locations` INNER JOIN `meet_locations` ON `locations`.`id` = `meet_locations`.`location_id` WHERE `meet_locations`.`user_id` = 21 AND (start_date >= '2013-07-02 01:12:34' and start_date <= '2013-07-10 01:12:34') ORDER BY start_date
SELECT `locations`.* FROM `locations` INNER JOIN `meet_locations` ON `locations`.`id` = `meet_locations`.`location_id` WHERE `meet_locations`.`user_id` = 21
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def usersLocationMet

    msg = Hash.new

    #logger.info "get distance #{distance([46.3625, 15.114444],[46.055556, 14.508333])}"

    if params[:user_id].nil?   || params[:recorded_at].nil?  || params[:passport_token].nil?#|| params[:longitude].nil?  || params[:latitude].nil?

      arr_params = ["user_id", "recorded_at", "passport_token"]
      msg[:response] = CodeHelper.CODE_MISSING_PARAMS(arr_params)
      msg[:description] = "需要提供必要参数"
      render :json =>  msg.to_json
      return
    end

    checkUser = checkUserExistBeforeOperationStart(params[:user_id], msg)

    if checkUser

      meet_date = Time.parse(params[:recorded_at])
      meet_date_max = meet_date + 1.hour
      meet_date_min = meet_date - 1.hour

      userMetLocations = Location.where("user_id != ? and start_date > ?  and start_date < ?", params[:user_id], meet_date_min, meet_date_max)
---
SELECT `locations`.* FROM `locations` WHERE (user_id != '21' and start_date > '2014-07-08 10:52:16' and start_date < '2014-07-08 12:52:16')

  def findSpecifcUsers

    msg = Hash.new

    #logger.info "get distance #{distance([46.3625, 15.114444],[46.055556, 14.508333])}"

    if params[:user_id].nil? || params[:passport_token].nil?#|| params[:longitude].nil?  || params[:latitude].nil?

      arr_params = ["user_id", "passport_token"]
      msg[:response] = CodeHelper.CODE_MISSING_PARAMS(arr_params)
      msg[:description] = "需要提供必要参数"
      render :json =>  msg.to_json
      return
    end

    userIds = params[:user_id].split(/,/)
    users = User.find_all_by_id(userIds)

    if users.count == 0
---
SELECT COUNT(*) FROM `users` WHERE (id IN ('20,21,23,24'))